- 누락 및 중복 데이터 정리하기 위해서,
- 적절한 값으로 대체 및 제거

In [1]:
# 누락데이터 확인
# 1. 데이터프레임의 요약정보를 출력 : info()
import seaborn as sns
df = sns.load_dataset('titanic')
print(df)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [2]:
df.info()
# age변수의 누락데이터가 있음을 확인 가능

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [3]:
# 특정변수의 빈도분석 : value_count()
nan_town = df['embark_town'].value_counts(dropna=False)
print(nan_town)

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [4]:
# 결측치 여부를 직접 확인 : isnull()/notnull()
# isnull()은 결측값존재시 True를 반환
# notnull()은 결측값존재시 False를 반환

print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [5]:
print(df.head().isnull())

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False

In [6]:
print(df.head().notnull())

   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True

In [7]:
# 누락 데이터제거
# 누락데이터가 존재하는 열또는 행을 삭제 -> 유효데이터가 50%이하인 deck열이 제거됨
df_thresh = df.dropna(axis=1, thresh=495)
df_thresh.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB

In [8]:
# 데이터분석 시 포함되어야 하는 변수에 누락데이터가 존재할경우
# 변수가 아닌 누락된 레코드를 삭제하는 방식으로 정리
df_age = df.dropna(subset=['age'], how='any', axis=0)
print(df_age)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[714 rows x 15 columns]

In [9]:
# age와 deck 두 변수중 하나라도 누락된 레코드를 삭제
df_1 = df.dropna(subset=['age','deck'], how='any', axis=0)
print(df_1)

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1           1       1  female  38.0      1      0  71.2833        C  First
3           1       1  female  35.0      1      0  53.1000        S  First
6           0       1    male  54.0      0      0  51.8625        S  First
10          1       3  female   4.0      1      1  16.7000        S  Third
11          1       1  female  58.0      0      0  26.5500        S  First
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
871         1       1  female  47.0      1      1  52.5542        S  First
872         0       1    male  33.0      0      0   5.0000        S  First
879         1       1  female  56.0      0      1  83.1583        C  First
887         1       1  female  19.0      0      0  30.0000        S  First
889         1       1    male  26.0      0      0  30.0000        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
6      man        True    E  Southampton    no   True
10   child       False    G  Southampton   yes  False
11   woman       False    C  Southampton   yes   True
..     ...         ...  ...          ...   ...    ...
871  woman       False    D  Southampton   yes  False
872    man        True    B  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True

[184 rows x 15 columns]

In [10]:
# age와 deck 변수 모두 누락된 레코드 삭제
df_2 = df.dropna(subset=['age','deck'], how='all', axis=0)
print(df_2)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[733 rows x 15 columns]

In [11]:
# 누락데이터치환
# 평균/중앙/최빈값을 데이터의 분포와 특성을 잘 보여줄 수 있도록 대체
# 평균값 대체
mean_age = df['age'].mean(axis=0)
mean_age

29.69911764705882

In [12]:
df['age'].fillna(mean_age, inplace=True)
print(df.head(10))

   survived  pclass     sex        age  sibsp  parch     fare embarked  \
0         0       3    male  22.000000      1      0   7.2500        S
1         1       1  female  38.000000      1      0  71.2833        C
2         1       3  female  26.000000      0      0   7.9250        S
3         1       1  female  35.000000      1      0  53.1000        S
4         0       3    male  35.000000      0      0   8.0500        S
5         0       3    male  29.699118      0      0   8.4583        Q
6         0       1    male  54.000000      0      0  51.8625        S
7         0       3    male   2.000000      3      1  21.0750        S
8         1       3  female  27.000000      0      2  11.1333        S
9         1       2  female  14.000000      1      0  30.0708        C

    class    who  adult_male deck  embark_town alive  alone
0   Third    man        True  NaN  Southampton    no  False
1   First  woman       False    C    Cherbourg   yes  False
2   Third  woman       False  NaN  Southampton   yes   True
3   First  woman       False    C  Southampton   yes  False
4   Third    man        True  NaN  Southampton    no   True
5   Third    man        True  NaN   Queenstown    no   True
6   First    man        True    E  Southampton    no   True
7   Third  child       False  NaN  Southampton    no  False
8   Third  woman       False  NaN  Southampton   yes  False
9  Second  child       False  NaN    Cherbourg   yes  False

In [13]:
# 최빈값 대체
df = sns.load_dataset('titanic')
print(df[825:835])

     survived  pclass     sex    age  sibsp  parch     fare embarked   class  \
825         0       3    male    NaN      0      0   6.9500        Q   Third
826         0       3    male    NaN      0      0  56.4958        S   Third
827         1       2    male   1.00      0      2  37.0042        C  Second
828         1       3    male    NaN      0      0   7.7500        Q   Third
829         1       1  female  62.00      0      0  80.0000      NaN   First
830         1       3  female  15.00      1      0  14.4542        C   Third
831         1       2    male   0.83      1      1  18.7500        S  Second
832         0       3    male    NaN      0      0   7.2292        C   Third
833         0       3    male  23.00      0      0   7.8542        S   Third
834         0       3    male  18.00      0      0   8.3000        S   Third

       who  adult_male deck  embark_town alive  alone
825    man        True  NaN   Queenstown    no   True
826    man        True  NaN  Southampton    no   True
827  child       False  NaN    Cherbourg   yes  False
828    man        True  NaN   Queenstown   yes   True
829  woman       False    B          NaN   yes   True
830  child       False  NaN    Cherbourg   yes  False
831  child       False  NaN  Southampton   yes  False
832    man        True  NaN    Cherbourg    no   True
833    man        True  NaN  Southampton    no   True
834    man        True  NaN  Southampton    no   True

In [15]:
# 1. 결측값 제외하고 embark_town의 빈도를 구하고,
# 2. 데이터프레임의 최대값의 인덱스 반환
most_freq = df['embark_town'].value_counts(dropna=True).idxmax()
print(most_freq)

Southampton

In [16]:
df['embark_town'].fillna(most_freq, inplace=True)
print(df[825:835])

     survived  pclass     sex    age  sibsp  parch     fare embarked   class  \
825         0       3    male    NaN      0      0   6.9500        Q   Third
826         0       3    male    NaN      0      0  56.4958        S   Third
827         1       2    male   1.00      0      2  37.0042        C  Second
828         1       3    male    NaN      0      0   7.7500        Q   Third
829         1       1  female  62.00      0      0  80.0000      NaN   First
830         1       3  female  15.00      1      0  14.4542        C   Third
831         1       2    male   0.83      1      1  18.7500        S  Second
832         0       3    male    NaN      0      0   7.2292        C   Third
833         0       3    male  23.00      0      0   7.8542        S   Third
834         0       3    male  18.00      0      0   8.3000        S   Third

       who  adult_male deck  embark_town alive  alone
825    man        True  NaN   Queenstown    no   True
826    man        True  NaN  Southampton    no   True
827  child       False  NaN    Cherbourg   yes  False
828    man        True  NaN   Queenstown   yes   True
829  woman       False    B  Southampton   yes   True
830  child       False  NaN    Cherbourg   yes  False
831  child       False  NaN  Southampton   yes  False
832    man        True  NaN    Cherbourg    no   True
833    man        True  NaN  Southampton    no   True
834    man        True  NaN  Southampton    no   True

In [18]:
# 결측값을 서로 이웃하고 있는 데이터로 대체하는 경우
import seaborn as sns
df=sns.load_dataset('titanic')
print(df[825:835])

     survived  pclass     sex    age  sibsp  parch     fare embarked   class  \
825         0       3    male    NaN      0      0   6.9500        Q   Third
826         0       3    male    NaN      0      0  56.4958        S   Third
827         1       2    male   1.00      0      2  37.0042        C  Second
828         1       3    male    NaN      0      0   7.7500        Q   Third
829         1       1  female  62.00      0      0  80.0000      NaN   First
830         1       3  female  15.00      1      0  14.4542        C   Third
831         1       2    male   0.83      1      1  18.7500        S  Second
832         0       3    male    NaN      0      0   7.2292        C   Third
833         0       3    male  23.00      0      0   7.8542        S   Third
834         0       3    male  18.00      0      0   8.3000        S   Third

       who  adult_male deck  embark_town alive  alone
825    man        True  NaN   Queenstown    no   True
826    man        True  NaN  Southampton    no   True
827  child       False  NaN    Cherbourg   yes  False
828    man        True  NaN   Queenstown   yes   True
829  woman       False    B          NaN   yes   True
830  child       False  NaN    Cherbourg   yes  False
831  child       False  NaN  Southampton   yes  False
832    man        True  NaN    Cherbourg    no   True
833    man        True  NaN  Southampton    no   True
834    man        True  NaN  Southampton    no   True

In [19]:
df['embark_town'].fillna(method='ffill', inplace=True)

In [20]:
print(df[825:935])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
825         0       3    male   NaN      0      0   6.9500        Q   Third
826         0       3    male   NaN      0      0  56.4958        S   Third
827         1       2    male   1.0      0      2  37.0042        C  Second
828         1       3    male   NaN      0      0   7.7500        Q   Third
829         1       1  female  62.0      0      0  80.0000      NaN   First
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
825    man        True  NaN   Queenstown    no   True
826    man        True  NaN  Southampton    no   True
827  child       False  NaN    Cherbourg   yes  False
828    man        True  NaN   Queenstown   yes   True
829  woman       False    B   Queenstown   yes   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[66 rows x 15 columns]

In [21]:
# 결측값을 특정 지정값으로 대체해야 하는 경우
import seaborn as sns
df = sns.load_dataset('titanic')
print(df.iloc[825:831])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
825         0       3    male   NaN      0      0   6.9500        Q   Third
826         0       3    male   NaN      0      0  56.4958        S   Third
827         1       2    male   1.0      0      2  37.0042        C  Second
828         1       3    male   NaN      0      0   7.7500        Q   Third
829         1       1  female  62.0      0      0  80.0000      NaN   First
830         1       3  female  15.0      1      0  14.4542        C   Third

       who  adult_male deck  embark_town alive  alone
825    man        True  NaN   Queenstown    no   True
826    man        True  NaN  Southampton    no   True
827  child       False  NaN    Cherbourg   yes  False
828    man        True  NaN   Queenstown   yes   True
829  woman       False    B          NaN   yes   True
830  child       False  NaN    Cherbourg   yes  False

In [22]:
import numpy as np
df['embark_town'].replace({np.nan:"Queenstown"}, inplace=True)
print(df.iloc[825:831])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
825         0       3    male   NaN      0      0   6.9500        Q   Third
826         0       3    male   NaN      0      0  56.4958        S   Third
827         1       2    male   1.0      0      2  37.0042        C  Second
828         1       3    male   NaN      0      0   7.7500        Q   Third
829         1       1  female  62.0      0      0  80.0000      NaN   First
830         1       3  female  15.0      1      0  14.4542        C   Third

       who  adult_male deck  embark_town alive  alone
825    man        True  NaN   Queenstown    no   True
826    man        True  NaN  Southampton    no   True
827  child       False  NaN    Cherbourg   yes  False
828    man        True  NaN   Queenstown   yes   True
829  woman       False    B   Queenstown   yes   True
830  child       False  NaN    Cherbourg   yes  False

In [23]:
# 중복 데이터 확인
import pandas as pd
exam_data = {'Date':['2021-01-01','2021-01-01','2021-01-02','2021-01-03'],
            'Code':['T10001','T10001','S10001','S10002'],
            'Color':['Black','Black','White','White']}
df = pd.DataFrame(exam_data)
print(df)

         Date    Code  Color
0  2021-01-01  T10001  Black
1  2021-01-01  T10001  Black
2  2021-01-02  S10001  White
3  2021-01-03  S10002  White

In [24]:
# 중복된 데이터이면 True를 반환, 중복되지 않으면 False를 반환
df.duplicated(subset=['Date','Code'])

0    False
1     True
2    False
3    False
dtype: bool

In [25]:
# drop_duplictes() : 동일한 관측값이 중복되었을때 제거
df_dup = df.drop_duplicates(subset=['Date','Code'])
print(df_dup)

         Date    Code  Color
0  2021-01-01  T10001  Black
2  2021-01-02  S10001  White
3  2021-01-03  S10002  White

In [26]:
# 데이터분석 실습
# 1. 데이터 불러오기
import seaborn as sns
df = sns.load_dataset('planets')
print(df)

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [27]:
# 2. info()함수를 사용해 자료를 살펴보기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [28]:
# 3. 중복 자료 존재여부 확인
print(df.iloc[900:906])

           method  number  orbital_period  mass  distance  year
900       Imaging       1     40000.00000   NaN       NaN  2011
901       Transit       1         3.91405   NaN    2000.0  2007
902  Microlensing       1             NaN   NaN       NaN  2008
903  Microlensing       1             NaN   NaN       NaN  2008
904  Microlensing       1             NaN   NaN       NaN  2009
905  Microlensing       1             NaN   NaN    3600.0  2013

In [29]:
df_dup = df.drop_duplicates()
print(df_dup.iloc[900:906])

           method  number  orbital_period  mass  distance  year
900       Imaging       1     40000.00000   NaN       NaN  2011
901       Transit       1         3.91405   NaN    2000.0  2007
902  Microlensing       1             NaN   NaN       NaN  2008
904  Microlensing       1             NaN   NaN       NaN  2009
905  Microlensing       1             NaN   NaN    3600.0  2013
906  Microlensing       1      2780.00000   NaN       NaN  2011

In [30]:
# 4. info()를 실행하여 중복데이터 삭제여부 확인
df_dup.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1031 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1031 non-null   object
 1   number          1031 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        807 non-null    float64
 5   year            1031 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 56.4+ KB

In [31]:
# 5. 누락 데이터제거
df_thresh = df_dup.dropna(axis=1,thresh=600)
df_thresh.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1031 entries, 0 to 1034
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1031 non-null   object
 1   number          1031 non-null   int64
 2   orbital_period  992 non-null    float64
 3   distance        807 non-null    float64
 4   year            1031 non-null   int64
dtypes: float64(2), int64(2), object(1)
memory usage: 48.3+ KB

In [32]:
# 누락데이터 대체
mean_period = df_thresh['orbital_period'].mean(axis=0)
df_thresh['orbital_period'].fillna(mean_period, inplace=True)
print(df_thresh.iloc[25:31])

             method  number  orbital_period  distance  year
25  Radial Velocity       1      116.688400     18.11  1996
26  Radial Velocity       1      691.900000     81.50  2012
27  Radial Velocity       1      952.700000     97.18  2008
28  Radial Velocity       1      181.400000     45.52  2013
29          Imaging       1     2002.917596     45.52  2005
30          Imaging       1     2002.917596    165.00  2007

C:\Users\M\.conda\envs\cospropython\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)